Revit 2027 API
NurbsSurfaceData.GetControlPoints Method
 Get the list of control points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetControlPoints()
Public Function GetControlPoints As IList(Of XYZ)
public:
IList<XYZ^>^ GetControlPoints()
member GetControlPoints : unit -> IList<XYZ>
Return Value
IList<XYZ>
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace